The base class used for pre events where the arguments must supply access to the document.
  Namespace:   Autodesk.Revit.DB.Events
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.0.0.420)
  Since:  2010
 Syntax
  C#
public class RevitAPIPreDocEventArgs : RevitAPIPreEventArgs
  Visual Basic
Public Class RevitAPIPreDocEventArgs _
	Inherits RevitAPIPreEventArgs
  Visual C++
public ref class RevitAPIPreDocEventArgs : public RevitAPIPreEventArgs
 Inheritance Hierarchy
  System Object
  System EventArgs
  Autodesk.Revit.DB.Events RevitAPIEventArgs
  Autodesk.Revit.DB.Events RevitAPIPreEventArgs
  Autodesk.Revit.DB.Events RevitAPIPreDocEventArgs
  Autodesk.Revit.DB.Events DocumentClosingEventArgs
  Autodesk.Revit.DB.Events DocumentPrintingEventArgs
  Autodesk.Revit.DB.Events DocumentSavingAsEventArgs
  Autodesk.Revit.DB.Events DocumentSavingEventArgs
  Autodesk.Revit.DB.Events DocumentSynchronizingWithCentralEventArgs
  Autodesk.Revit.DB.Events ElementTypeDuplicatingEventArgs
  Autodesk.Revit.DB.Events FamilyLoadingIntoDocumentEventArgs
  Autodesk.Revit.DB.Events FileExportingEventArgs
  Autodesk.Revit.DB.Events FileImportingEventArgs
  Autodesk.Revit.DB.Events ViewExportingEventArgs
  Autodesk.Revit.DB.Events ViewPrintingEventArgs
  Autodesk.Revit.UI.Events TransferringProjectStandardsEventArgs
  Autodesk.Revit.UI.Events ViewActivatingEventArgs
 See Also
  RevitAPIPreDocEventArgs Members
  Autodesk.Revit.DB.Events Namespace